In [1]:
import pandas as pd

In [2]:
empleados = pd.DataFrame({
    'EmpID': [1, 2, 3, 4],
    'DeptoID': [10, 20, 30, 40],
    'Nombre': ['Carlos', 'Sofía', 'Pedro', 'Laura'],
    'Puesto': ['Gerente', 'Analista', None, 'Desarrollador']
})
empleados

   EmpID  DeptoID  Nombre         Puesto
0      1       10  Carlos        Gerente
1      2       20   Sofía       Analista
2      3       30   Pedro           None
3      4       40   Laura  Desarrollador

In [4]:
departamentos = pd.DataFrame({
    'DeptoID': [10, 20, 30, 50],
    'UbicacionID': [100, 200, 300, 500],
    'NombreDepto': ['Ventas', 'TI', 'RH', 'Marketing']
})
departamentos

   DeptoID  UbicacionID NombreDepto
0       10          100      Ventas
1       20          200          TI
2       30          300          RH
3       50          500   Marketing

In [10]:
combinado = pd.merge(
    empleados.rename(columns={'DeptoID': 'DepID'}),
    departamentos.rename(columns={'DeptoID': 'DepID'}),
    on='DepID',
    how='left',
    suffixes=('_Empleado', '_Departamento')
)
combinado

   EmpID  DepID  Nombre         Puesto  UbicacionID NombreDepto
0      1     10  Carlos        Gerente        100.0      Ventas
1      2     20   Sofía       Analista        200.0          TI
2      3     30   Pedro           None        300.0          RH
3      4     40   Laura  Desarrollador          NaN         NaN